app/controllers/api/questions_controller.rb

INSERT INTO "questions" ("title", "text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Who is the best Avenger?"], ["text", "Please say Spiderman"], ["user_id", 1], ["created_at", "2020-03-04 00:28:41.600802"], ["updated_at", "2020-03-04 00:28:41.600802"]]
---
    def create
        @question = Question.new(question_params)
        @question.user_id = current_user.id
        if @question.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions"
---
    def index
        if params.has_key?(:user_id)
            user = User.find_by(id: params[:user_id])
            if params.has_key?(:answer_id)
                @questions = user.questions_user_answered
            else
                @questions = user.questions
            end
        else
            @questions = Question.all

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def show
        @question = Question.find_by(id: params[:id])