app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        # find them by username (not ids)
        @user = User.find_by(id: params[:id])