app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "QNrfB9MD3M32lBlpa3enmQ"], ["updated_at", "2020-03-04 00:40:32.432511"], ["id", 1]]